ConnectTest/src/InformationRegisters/gymsProducts/gymsProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>gymsProducts</name>
  <resources>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>productDirection</name>
    <type>
      <types>EnumRef.productDirections</types>
    </type>
  </dimensions>
  <dimensions>
    <name>gym</name>
    <type>
      <types>CatalogRef.gyms</types>
    </type>
  </dimensions>
  <dimensions>
    <name>product</name>
    <type>
      <types>CatalogRef.products</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/InformationRegisters/gymsProducts/ManagerModule.bsl
Function attributesStructure(requestName) Export
	
	attributesTable = DataLoad.getValueTable();
	attributesTableForNewItem = DataLoad.getValueTable();
	
	DataLoad.addRowInAttributesTable(attributesTable, "productDirection", "productDirection", "enum");
	DataLoad.addRowInAttributesTable(attributesTable, "gym", "gym", "ref");
	DataLoad.addRowInAttributesTable(attributesTable, "product", "product", "ref");

	mdStruct = New Structure();
	mdStruct.Insert("gym", New Structure("gyms", "uid"));
	mdStruct.Insert("product", New Structure("products", "uid"));
	
	actType = ?(requestName = "deletegymproducts", "delete", "write"); 
	
	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", False, "gymsProducts", "informationRegister", actType, attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
